sterentev/atdf-device-asm-include/inc/ATmega1284P.inc
; ----------	Register TCCR2A bits		------------------------
.equ	COM2A_MASK	= 0xC0		;      - Compare Output Mode bits (2 bits)
.equ	COM2A0		= 6		;          COM2A BIT0 position
.equ	COM2B_MASK	= 0x30		;      - Compare Output Mode bits (2 bits)
.equ	COM2B0		= 4		;          COM2B BIT0 position
.equ	WGM2_MASK	= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	WGM20		= 0		;          WGM2 BIT0 position

; ----------	Register TCCR2B bits		------------------------
.equ	FOC2A		= 7		; 0x80 - Force Output Compare A
.equ	FOC2B		= 6		; 0x40 - Force Output Compare B
.equ	WGM22		= 3		; 0x08 - Waveform Generation Mode
.equ	CS2_MASK	= 0x07		;      - Clock Select bits (3 bits)
.equ	CS20		= 0		;          CS2 BIT0 position
; ::::  CS2	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/32
;			0x04		; Running, CLK/64
;			0x05		; Running, CLK/128
;			0x06		; Running, CLK/256
;			0x07		; Running, CLK/1024

; ----------	Register TCNT2 bits		------------------------
.equ	TCNT2_MASK	= 0xFF		;      - Timer/Counter2 bits (8 bits)
.equ	TCNT20		= 0		;          TCNT2 BIT0 position

; ----------	Register OCR2B bits		------------------------
.equ	OCR2B_MASK	= 0xFF		;      - Timer/Counter2 Output Compare B bits (8 bits)
.equ	OCR2B0		= 0		;          OCR2B BIT0 position

; ----------	Register OCR2A bits		------------------------
.equ	OCR2A_MASK	= 0xFF		;      - Timer/Counter2 Output Compare A bits (8 bits)
.equ	OCR2A0		= 0		;          OCR2A BIT0 position

; ----------	Register ASSR bits		------------------------
.equ	EXCLK		= 6		; 0x40 - Enable External Clock Input
.equ	AS2		= 5		; 0x20 - Asynchronous Timer/Counter2
.equ	TCN2UB		= 4		; 0x10 - Timer/Counter2 Update Busy
.equ	OCR2AUB		= 3		; 0x08 - Output Compare Register2 Update Busy
.equ	OCR2BUB		= 2		; 0x04 - Output Compare Register 2 Update Busy
.equ	TCR2AUB		= 1		; 0x02 - Timer/Counter Control Register2 Update Busy
.equ	TCR2BUB		= 0		; 0x01 - Timer/Counter Control Register2 Update Busy

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSRASY		= 1		; 0x02 - Prescaler Reset Timer/Counter2



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read While Write section read enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC2_MASK	= 0x30		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC20		= 4		;          ISC2 BIT0 position
.equ	ISC1_MASK	= 0x0C		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  ISC2	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x10		; Any Logical Change of INTX
;			0x20		; Falling Edge of INTX
;			0x30		; Rising Edge of INTX
; ::::  ISC1	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x04		; Any Logical Change of INTX
;			0x08		; Falling Edge of INTX
;			0x0C		; Rising Edge of INTX
; ::::  ISC0	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x01		; Any Logical Change of INTX
;			0x02		; Falling Edge of INTX
;			0x03		; Rising Edge of INTX

; ----------	Register EIMSK bits		------------------------
.equ	INT_MASK	= 0x07		;      - External Interrupt Request 2 Enable (3 bits)
.equ	INT0		= 0		;          INT BIT0 position

; ----------	Register EIFR bits		------------------------
.equ	INTF_MASK	= 0x07		;      - External Interrupt Flags (3 bits)
.equ	INTF0		= 0		;          INTF BIT0 position

; ----------	Register PCMSK3 bits		------------------------
.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Masks (8 bits)
.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK2 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Masks (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK1 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Masks (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK0 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Masks (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCIFR bits		------------------------
.equ	PCIF_MASK	= 0x0F		;      - Pin Change Interrupt Flags (4 bits)
.equ	PCIF0		= 0		;          PCIF BIT0 position

; ----------	Register PCICR bits		------------------------
.equ	PCIE_MASK	= 0x0F		;      - Pin Change Interrupt Enables (4 bits)
.equ	PCIE0		= 0		;          PCIE BIT0 position



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - Left Adjust Result
.equ	MUX_MASK	= 0x1F		;      - Analog Channel and Gain Selection Bits (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal Vref turned off
;			0x40		; AVCC with external capacitor at AREF pin
;			0x80		; Internal 1.1V Voltage Reference with external capacitor at AREF pin
;			0xC0		; Internal 2.56V Voltage Reference with external capacitor at AREF pin
; ::::  MUX	:::: bitfield values
;			0x00		; ADC Single Ended Input pin 0
;			0x01		; ADC Single Ended Input pin 1
;			0x02		; ADC Single Ended Input pin 2
;			0x03		; ADC Single Ended Input pin 3
;			0x04		; ADC Single Ended Input pin 4
;			0x05		; ADC Single Ended Input pin 5
;			0x06		; ADC Single Ended Input pin 6
;			0x07		; ADC Single Ended Input pin 7
;			0x08		; ADC Differential Inputs Positive pin 0 Negative pin 0 10x Gain
;			0x09		; ADC Differential Inputs Positive pin 1 Negative pin 0 10x Gain
;			0x0A		; ADC Differential Inputs Positive pin 0 Negative pin 0 200x Gain
;			0x0B		; ADC Differential Inputs Positive pin 1 Negative pin 0 200x Gain
;			0x0C		; ADC Differential Inputs Positive pin 2 Negative pin 2 10x Gain
;			0x0D		; ADC Differential Inputs Positive pin 3 Negative pin 2 10x Gain
;			0x0E		; ADC Differential Inputs Positive pin 2 Negative pin 2 200x Gain
;			0x0F		; ADC Differential Inputs Positive pin 3 Negative pin 2 200x Gain
;			0x10		; ADC Differential Inputs Positive pin 0 Negative pin 1 1x Gain
;			0x11		; ADC Differential Inputs Positive pin 1 Negative pin 1 1x Gain
;			0x12		; ADC Differential Inputs Positive pin 2 Negative pin 1 1x Gain
;			0x13		; ADC Differential Inputs Positive pin 3 Negative pin 1 1x Gain
;			0x14		; ADC Differential Inputs Positive pin 4 Negative pin 1 1x Gain
;			0x15		; ADC Differential Inputs Positive pin 5 Negative pin 1 1x Gain
;			0x16		; ADC Differential Inputs Positive pin 6 Negative pin 1 1x Gain
;			0x17		; ADC Differential Inputs Positive pin 7 Negative pin 1 1x Gain
;			0x18		; ADC Differential Inputs Positive pin 0 Negative pin 2 1x Gain
;			0x19		; ADC Differential Inputs Positive pin 1 Negative pin 2 1x Gain
;			0x1A		; ADC Differential Inputs Positive pin 2 Negative pin 2 1x Gain
;			0x1B		; ADC Differential Inputs Positive pin 3 Negative pin 2 1x Gain
;			0x1C		; ADC Differential Inputs Positive pin 4 Negative pin 2 1x Gain
;			0x1D		; ADC Differential Inputs Positive pin 5 Negative pin 2 1x Gain
;			0x1E		; Internal Reference (VBG)
;			0x1F		; 0V (GND)

; ----------	Register ADC bits		------------------------
.equ	ADC_MASK	= 0xFFFF	;      - ADC Data bits (16 bits)
.equ	ADC0		= 0		;          ADC BIT0 position

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128

; ----------	Register ADCSRB bits		------------------------
;.equ	ACME		= 6		; 0x40 - 
.equ	ADTS_MASK	= 0x07		;      - ADC Auto Trigger Source bits (3 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position
; ::::  ADTS	:::: bitfield values
;			0x00		; Free Running mode
;			0x01		; Analog Comparator
;			0x02		; External Interrupt Request 0
;			0x03		; Timer/Counter0 Compare Match A
;			0x04		; Timer/Counter0 Overflow
;			0x05		; Timer/Counter1 Compare Match B
;			0x06		; Timer/Counter1 Overflow
;			0x07		; Timer/Counter1 Capture Event

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - 
.equ	ADC6D		= 6		; 0x40 - 
.equ	ADC5D		= 5		; 0x20 - 
.equ	ADC4D		= 4		; 0x10 - 
.equ	ADC3D		= 3		; 0x08 - 
.equ	ADC2D		= 2		; 0x04 - 
.equ	ADC1D		= 1		; 0x02 - 
.equ	ADC0D		= 0		; 0x01 - 



